*   TIMESTAMP=00000000000000                                                    
*   IDENTIFICAO DO MAPA                                                         
         PRINT ON,NOGEN                                                         
MAPS008  DFHMSD TYPE=MAP,LANG=COBOL,MODE=INOUT,STORAGE=AUTO,SUFFIX=     00000020
MAPS008  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),COLUMN=1,LINE=1,  *00000030
               DATA=FIELD,TIOAPFX=YES,OBFMT=NO                          00000040
*   CABECALHO DO MAPA                                                           
CICS     DFHMDF POS=(1,1),LENGTH=8,COLOR=GREEN,HILIGHT=UNDERLINE,      *        
               ATTRB=(PROT,FSET),INITIAL='CIC5A01 '                             
*----------------------------------------------------------------------         
* CAMPO DE SAÍDA                                                                
*----------------------------------------------------------------------         
         DFHMDF POS=(3,10),LENGTH=40,ATTRB=(ASKIP,NORM),               *        
               INITIAL='PRESSIONE UMA PF-KEY:',                        *        
               FIELD=OUT-MSG                                                    
                                                                                
*----------------------------------------------------------------------         
* CAMPO DE MENSAGEM                                                             
*----------------------------------------------------------------------         
         DFHMDF POS=(5,10),LENGTH=60,ATTRB=(ASKIP,NORM),               *        
               INITIAL=' ',FIELD=MSG                                            
                                                                                
*----------------------------------------------------------------------         
* LINHA DE COMANDOS PF                                                          
*----------------------------------------------------------------------         
         DFHMDF POS=(20,2),LENGTH=76,ATTRB=(ASKIP,NORM),               *        
               INITIAL='PF3=SAIR PF5=MENS PF6=INFO PF7=ANT PF8=PROX PF1*        
               2=ERRO',                                                *        
               FIELD=PF-LINE                                                    
                                                                                
*   FINAL DE MAPA                                                               
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
************************************************************************        
