         TITLE 'MAPS005                         '                               
         PRINT ON,NOGEN                                                         
MAPS005  DFHMSD TYPE=MAP,LANG=COBOL,MODE=INOUT,STORAGE=AUTO,SUFFIX=             
MAPS005  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),COLUMN=1,LINE=1,  *        
               DATA=FIELD,TIOAPFX=YES,OBFMT=NO                                  
* 0000-PROGRAMA                   0000-PROGRAMA                                 
DFH0001  DFHMDF POS=(1,1),LENGTH=8,ATTRB=(PROT),COLOR=TURQUOISE                 
         DFHMDF POS=(1,10),LENGTH=1,ATTRB=(PROT,NORM)                           
         DFHMDF POS=(1,29),LENGTH=20,INITIAL='SERVICO ONLINE      ',   *        
               ATTRB=(PROT,NORM)                                                
* 0000-DATA                       0000-DATA                                     
DFH0002  DFHMDF POS=(1,70),LENGTH=10,ATTRB=(PROT),COLOR=TURQUOISE               
* 0000-TERMINAL                   0000-TERMINAL                                 
DFH0003  DFHMDF POS=(2,1),LENGTH=8,ATTRB=(PROT),COLOR=TURQUOISE                 
         DFHMDF POS=(2,10),LENGTH=1,ATTRB=(PROT,NORM)                           
* 0000-HORA                       0000-HORA                                     
DFH0004  DFHMDF POS=(2,70),LENGTH=8,ATTRB=(PROT),COLOR=TURQUOISE                
         DFHMDF POS=(2,79),LENGTH=1,ATTRB=(PROT,NORM)                           
         DFHMDF POS=(3,1),LENGTH=79,                                   *        
               INITIAL='-----------------------------------------------*        
               --------------------------------',ATTRB=(PROT,NORM)              
         DFHMDF POS=(5,1),LENGTH=24,INITIAL='HELLO WORLD             ',*        
               ATTRB=(PROT,NORM)                                                
******************************************** TRAILLER                           
         DFHMDF POS=(18,1),LENGTH=79,                                  *        
               INITIAL='-----------------------------------------------*        
               --------------------------------',ATTRB=(PROT)                   
* 0000-MSG                        0000-MSG                                      
MSGERRO  DFHMDF POS=(20,1),LENGTH=50,ATTRB=(PROT),COLOR=NEUTRAL                 
         DFHMDF POS=(20,52),LENGTH=1,ATTRB=(PROT,NORM)                          
         DFHMDF POS=(22,1),LENGTH=79,                                  *        
               INITIAL='-----------------------------------------------*        
               --------------------------------',ATTRB=(PROT)                   
         DFHMDF POS=(23,1),LENGTH=2,INITIAL='F3',ATTRB=(PROT),         *        
               COLOR=NEUTRAL                                                    
         DFHMDF POS=(23,4),LENGTH=7,INITIAL='- FIM |',ATTRB=(PROT,NORM)         
         DFHMDF POS=(23,12),LENGTH=5,INITIAL='ENTER',ATTRB=(PROT),     *        
               COLOR=NEUTRAL                                                    
         DFHMDF POS=(23,18),LENGTH=20,INITIAL='                    ',  *        
               ATTRB=(PROT,NORM)                                                
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
