*   TIMESTAMP=00000000000000                                                    
*   IDENTIFICAO DO MAPA                                                         
         PRINT ON,NOGEN                                                         
MAPS004  DFHMSD TYPE=MAP,LANG=COBOL,MODE=INOUT,STORAGE=AUTO,SUFFIX=     00000020
MAPS004  DFHMDI SIZE=(24,80),MAPATTS=(COLOR,HILIGHT),COLUMN=1,LINE=1,  *00000030
               DATA=FIELD,TIOAPFX=YES,OBFMT=NO                          00000040
*   CABECALHO DO MAPA                                                           
CICS     DFHMDF POS=(1,1),LENGTH=8,COLOR=GREEN,HILIGHT=UNDERLINE,      *        
               ATTRB=(PROT,FSET),INITIAL='CIC5A01 '                             
         DFHMDF POS=(1,29),LENGTH=30,COLOR=TURQUOISE,HILIGHT=OFF,      *        
               ATTRB=(ASKIP,NORM),INITIAL='MENU PRINCIPAL BELLACOSA'            
DATA     DFHMDF POS=(1,70),LENGTH=10,COLOR=DEFAULT,HILIGHT=OFF,        *        
               ATTRB=(PROT,NORM)                                                
*                                                                               
USERID   DFHMDF POS=(2,1),LENGTH=8,COLOR=GREEN,HILIGHT=UNDERLINE,      *        
               ATTRB=(PROT,FSET),INITIAL='IBMUSER '                             
HORA     DFHMDF POS=(2,72),LENGTH=8,COLOR=DEFAULT,HILIGHT=OFF,         *        
               ATTRB=(PROT,NORM)                                                
*                                                                               
         DFHMDF POS=(3,28),LENGTH=25,COLOR=TURQUOISE,HILIGHT=OFF,      *        
               ATTRB=(ASKIP,NORM),INITIAL='COBOL + CICS + VSAM + BMS'           
*   AREA DE OUTPUT                                                              
         DFHMDF POS=(07,10),LENGTH=40,COLOR=TURQUOISE,HILIGHT=OFF,     *        
               ATTRB=(ASKIP,NORM),INITIAL='[F4] = CADASTRO ALUNO'               
         DFHMDF POS=(09,10),LENGTH=40,COLOR=TURQUOISE,HILIGHT=OFF,     *        
               ATTRB=(ASKIP,NORM),INITIAL='[F5] = NOTAS DE PROVA'               
         DFHMDF POS=(11,10),LENGTH=40,COLOR=TURQUOISE,HILIGHT=OFF,     *        
               ATTRB=(ASKIP,NORM),INITIAL='[F6] = CALCULO MEDIA'                
         DFHMDF POS=(13,10),LENGTH=40,COLOR=TURQUOISE,HILIGHT=OFF,     *        
               ATTRB=(ASKIP,NORM),INITIAL='[F8] = RELATORIO'                    
*   AREA DE RODAPE                                                              
         DFHMDF POS=(20,1),LENGTH=79,COLOR=TURQUOISE,HILIGHT=OFF,      *        
               ATTRB=(ASKIP,NORM),INITIAL='----------------------------*        
               -------------------------------------------------'               
MSGERRO  DFHMDF POS=(21,01),LENGTH=50,COLOR=DEFAULT,HILIGHT=OFF,       *        
               ATTRB=(PROT,NORM)                                                
         DFHMDF POS=(22,1),LENGTH=79,COLOR=TURQUOISE,HILIGHT=OFF,      *        
               ATTRB=(ASKIP,NORM),INITIAL='----------------------------*        
               -------------------------------------------------'               
         DFHMDF POS=(23,1),LENGTH=10,COLOR=TURQUOISE,HILIGHT=OFF,      *        
               ATTRB=(ASKIP,NORM),INITIAL='[F3] = FIM'                          
*   FINAL DE MAPA                                                               
         DFHMSD TYPE=FINAL                                                      
         END                                                                    
